fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
#include <Arduino.h>
#include <WiFi.h>
#include "PubSubClient.h"
#include <HTTPUpdate.h>
#include "esp_http_client.h"
#include "ArduinoJson.h"
#include <stdio.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_system.h"
#include "esp_log.h"
#include "driver/uart.h"
#include "string.h"
#include "driver/gpio.h"


#include "config.hpp"
#include "Utils.hpp"
LightUtils utils;


// ST7735驱动芯片的图形和字体库
#include <TFT_eSPI.h> 
#include <SPI.h>
 
// 调用库，引脚在User_Setup.h中定义
TFT_eSPI tft = TFT_eSPI(); 
 
void ftf_display(void);
void alarmAction(void);

// 自动化任务 列表
JsonArray combineAutoArr ;
// 解析自动化任务缓存
StaticJsonDocument<1024*10> docauto;
// 自动化任务列表显示的flag
boolean combineAutoArrFlag = false;


// 自动化任务数量
 int8_t demand_count = 0;
// 是否马上拉取自动化任务的flag
boolean getCombinemonitorFlag = false;


void combinecontrollFunc(JsonArray cmdcombine);
void combinemonitorFunc(JsonArray cmdcombine);
void getCombineAutoByCidHardware(String cid);

// 红外 自定义发射 -空调ac控制--海尔空调
#include <IRremoteESP8266.h>
#include <IRsend.h>
#include <ir_Haier.h>
IRHaierACYRW02 haier_ac(kIrLed);

#include <string.h>
#define uint unsigned int


//温湿度定义
 DHT11Struct dht11;

// delay for half a second
int delayval = 1000; 

// 重启设备--阈值
int restartCount = 0; 


void videoUploadBegin(void);
void videoUploadStop(void);
void desetup_camera(void);
void setup_camera(void);
float getVoltage(int pin);
void send_fotamsg(String fotastatus ,String toastmsg ,String loading ,u8_t loadingmaxtime ,String progress);

//摄像头
#include "esp_camera.h"
#include "UdpClient.hpp"

#ifndef OVER_LOAD_CAM_CONF
// #define CAMERA_MODEL_AI_THINKER
#define FRAMESIZE FRAMESIZE_VGA
#define HE_ZHOU_S3
#endif

#include "cam_pins.h"




/*
   发送图片的UDP的定义--摄像头相关
  */
const uint16_t localUdpPort = 2333;
LightUDP streamSender;
 boolean videoUploadFlag = false;
 boolean videoUploadInitFlag = false;
 boolean cameraFlag = false;//视频开关状态


// 重启设备flag标识
boolean esp_restartFlag = false;
// 是否自动上传视频的flag
boolean autoUploadFlag = false;
// 十分钟拍一张图片 10s一次，默认60次后恢复0
int tim1_Photo_count = 0;
//fota的状态
int fota_status = 0;
boolean fotaFlag = false;
String updateurl= "";
String updateversion= "";
int totalProgress = -1;


// 定时器初始化
hw_timer_t *tim1 = NULL;
int tim1_IRQ_count = 0;

//全局的TCP连接，在发送UDP的时候，可以检测TCP获取的ID是否变化，以防服务端挂了后客户端不知道
WiFiClient client;

PubSubClient mqttclient(client);

// #include "esp_task_wdt.h"
// #define TWDT_TIMEOUT_S  30


//-----------网络时间获取-----------//
#define NTP1 "ntp1.aliyun.com"
#define NTP2 "ntp2.aliyun.com"
#define NTP3 "ntp3.aliyun.com"

//时区设置函数，东八区（UTC/GMT+8:00）写成8*3600
const long gmtOffset_sec = 8 * 3600;    
const int daylightOffset_sec = 0;   //夏令时填写3600，否则填0



// 连接WiFi网络
void wifiConnect(const char *wifiData[][2], int numNetworks)
{
    WiFi.disconnect(true);

    for (int i = 0; i < numNetworks; ++i)
    {
        const char *ssid = wifiData[i][0];
        const char *password = wifiData[i][1];

        Serial.print("Connecting to ");
        Serial.println(ssid);

        WiFi.begin(ssid, password);
        uint8_t count = 0;
        while (WiFi.status() != WL_CONNECTED)
        {
            Serial.print(".");
            count++;
            if (count >= 6)
            {
                Serial.printf("\r\n-- wifi connect fail! --");
                break;
            }
            vTaskDelay(500);
        }

        if (WiFi.status() == WL_CONNECTED)
        {
            Serial.printf("\r\n-- wifi connect success! --\r\n");
            Serial.print("IP address: ");
            Serial.println(WiFi.localIP());
            Serial.println("Free Heap: " + String(ESP.getFreeHeap()));
            return; // 如果连接成功，退出函数
        }
    }  
}

// 获取自动化任务
void getCombineAutoByCidHardware(String cid)
{
 
    HTTPClient http;

    String nonce = utils.md5str(reporttime +'0'+ random(1000));

   TimeStruct stc =  utils.setClock(SRCCID);

    int64_t signt = stc.timeStamp ;

    String did = utils.md5str(reporttime +'0'+ random(1000));

    String str5 = "api/getCombineAutoByCidHardware_appkey=" + appkey + "_cid=" + cid + "_did=" + did +"_nonce="+nonce+ "_signt="+(signt *1000) +"_"+ secretkey;

    String str6 = utils.urlEncode(str5);

    String sign =  utils.md5str(str6);
    
    String url = combinecontroll_url  + "?cid=" + cid + "&did="+did+ "&nonce="+nonce+ "&signt="+(signt *1000)+ "&appkey="+ appkey + "&sign="+sign;
    Serial.println(url);
    // Serial.print(url);

    http.begin(url); //访问服务器地址

    // Serial.print("[HTTP] GET...n");
    // start connection and send HTTP header
    int httpCode = http.GET();

    // httpCode will be negative on error
    if(httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        // Serial.printf("[HTTP] GET... code: %dn", httpCode);

        // file found at server
        if(httpCode == HTTP_CODE_OK) {
            String payload = http.getString();
            Serial.println(payload);

               
                deserializeJson(docauto, payload);

                boolean status = docauto["status"];
                if (status)
                {
                    combineAutoArr =  docauto["data"]["list"].as<JsonArray>();;

                    demand_count = combineAutoArr.size();
                    deviceStatus = "get combineauto ok";
                    
                    // 获取成功的flag
                    combineAutoArrFlag = true;
                    //自动拉取的flag
                    getCombinemonitorFlag = false;
                
                }else{
                  Serial.printf("获取自动化任务失败1");
                 
                }
                   
        }else{
          Serial.printf("获取自动化任务失败2");
         
        }
    } else {
        Serial.printf("[HTTP] GET... failed, error: %sn", http.errorToString(httpCode).c_str());
    }
    http.end();

}

// 获取设备信息 
void getDeviceByMac(String mac){

 uint8_t wifi_failedcount = 0;

  while (SRCCID == "")
  {
    /* code */
 
    HTTPClient http;

    String nonce = utils.md5str(reporttime +'0'+ random(1000));

   TimeStruct stc =  utils.setClock(SRCCID);

    int64_t signt = stc.timeStamp ;

    String did = utils.md5str(reporttime +'0'+ random(1000));

    String str5 = "api/getDeviceByMac_appkey=" + appkey+"_did="+ did+ "_mac=" + mac +"_nonce="+nonce+ "_signt="+(signt *1000)+"_version="+ version +"_"+ secretkey;

    String str6 = utils.urlEncode(str5);

    String sign =  utils.md5str(str6);
    
