fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
    String url = getsrccid_url  + "?mac="+mac+ "&version="+version+ "&did="+did+ "&nonce="+nonce+ "&signt="+(signt *1000)+ "&appkey="+ appkey + "&sign="+sign;
    Serial.println(url);
    // Serial.print(url);

    http.begin(url); //访问服务器地址

    // Serial.print("[HTTP] GET...n");
    // start connection and send HTTP header
    int httpCode = http.GET();

    // httpCode will be negative on error
    if(httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        // Serial.printf("[HTTP] GET... code: %dn", httpCode);

        // file found at server
        if(httpCode == HTTP_CODE_OK) {
            String payload = http.getString();
            Serial.println(payload);

                StaticJsonDocument<1024> doc;
                deserializeJson(doc, payload);

                boolean status = doc["status"];
                if (status)
                {
                    const char* cid =  doc["data"]["cid"];

                    String newcid = cid;
                    SRCCID = newcid.c_str();
                    Serial.printf(newcid.c_str());


                    const char* clientmqttClientId =  doc["data"]["mqttClientId"];
                    String newmqttClientId = clientmqttClientId;
                    mqtt_mqttClientId = newmqttClientId.c_str();

                    const char* clientusername =  doc["data"]["username"];
                    String newusername = clientusername;
                    mqtt_username = newusername.c_str();
                    
                    const char* clientpasswd =  doc["data"]["passwd"];
                    String newpasswd = clientpasswd;
                    mqtt_passwd = newpasswd.c_str();

                    const char* clientmqttHostUrl =  doc["data"]["mqttHostUrl"];
                    String newmqttHostUrl = clientmqttHostUrl;
                    mqtt_mqttHostUrl = newmqttHostUrl.c_str();
                    
                    mqtt_port =  doc["data"]["port"];

                    const char* clientudphost =  doc["data"]["udphost"];
                    String newudphost = clientudphost;
                    udp_host = newudphost.c_str();
                    
                    udp_port =  doc["data"]["udpport"];

                    const char* clientphotourl =  doc["data"]["photourl"];
                    String newphotourl = clientphotourl;
                    photourl = newphotourl.c_str();
                    
                    const char* clientmqtt_pub_topic =  doc["data"]["mqtt_pub_topic"];
                    String mqtt_pub_topic = clientmqtt_pub_topic;
                    mqtt_pub_topicsss = mqtt_pub_topic.c_str();
                    

                    const char* clientmqtt_sub_topic =  doc["data"]["mqtt_sub_topic"];
                    String mqtt_sub_topic = clientmqtt_sub_topic;
                    mqtt_sub_topicsss = mqtt_sub_topic.c_str();
                    
                    const char* clientcombinecontrollurl =  doc["data"]["combinecontrollurl"];
                    String combinecontrollurl = clientcombinecontrollurl;
                    combinecontroll_url = combinecontrollurl.c_str();
                    
                  
                }
                   
        }else{
          Serial.printf("获取CID失败延时5s");
         
        }
    } else {
        Serial.printf("[HTTP] GET... failed, error: %sn", http.errorToString(httpCode).c_str());
    }
    http.end();
    // 延时3S继续获取
     if (SRCCID =="")
     {
       delay(3000);

        wifi_failedcount ++;
        if (wifi_failedcount >=5)
        {
          digitalWrite(alarm,HIGH);
          wifi_failedcount = 0;
        }

     }
     

  }


    wifi_failedcount = 0;
   digitalWrite(alarm,LOW);

}

// 当升级开始时，打印日志
void update_started() {
  totalProgress= -1;
  send_fotamsg("fota_started","升级开始","show",5,"--");
  Serial.println("CALLBACK:  HTTP update process started");
}


// 当升级中，打印日志
void update_progress(int cur, int total) {
  float aa = (float)cur;
  float bb = (float)total;
    int grs = (int)(aa/bb *100);
    String progress = (String) grs ;

  if (  totalProgress != grs)
  {
    /* code */
        send_fotamsg("fota_progress","升级中","show",5,progress);

  }
      totalProgress = grs;

  
  Serial.printf("CALLBACK:  HTTP update process at %d of %d bytes...%s...%d... \n", cur, total,progress,grs);
}

// 当升级结束时，打印日志
void update_finished() {
  totalProgress= -1;
    send_fotamsg("fota_finished","升级完成","hiden",0,"--");
  Serial.println("CALLBACK:  HTTP update process finished");
}


//当升级失败时，打印日志
void update_error(int err) {
  totalProgress= -1;
  send_fotamsg("fota_error","FOTA升级失败","hiden",0,"--");
  Serial.printf("CALLBACK:  HTTP update fatal error code %d\n", err);
}

// 升级信息上报
void send_fotamsg(String fotastatus ,String toastmsg ,String loading ,u8_t loadingmaxtime ,String progress){

    StaticJsonDocument<1024> doc;
        deserializeJson(doc, REPORT_COMMON_TEMPLATE);
       // setClock();
        doc["cid"] = SRCCID;


        doc["datatype"] = "dictionary";
        doc["version"] = version;
        doc["cmdtype"] = "cmd_fotaack";
        doc["loadingmaxtime"] = loadingmaxtime;
        doc["toastmsg"] = toastmsg;
        doc["loading"] = loading ;
        doc["progress"] = progress;
        doc["fotastatus"] = fotastatus;
        doc["reporttime"] = reporttime;

        
                
        String nonce = utils.md5str(reporttime +'0'+ random(1000));
        doc["nonce"]= nonce;

        TimeStruct stc =  utils.setClock(SRCCID);

        int64_t signt = stc.timeStamp ;

        doc["signt"] = (signt *1000)  ;
        String cidstr = SRCCID;
    
        String did = utils.md5str(reporttime +'0'+ random(1000));
        doc["did"] =  did;


        char  buffer[1024];
        size_t n = serializeJson(doc, buffer);
        Serial.println(buffer);


    //   const char *mqtt_pub_topic = mqtt_pub_topicsss.c_str();

        if (mqttclient.publish( mqtt_pub_topicsss.c_str(), buffer,n)) {
            // Serial.printf("auto topic fota [%s] ok\n", mqtt_pub_topic);
            
        } else {
            Serial.printf("auto topic fota [%s] fail\n",  mqtt_pub_topicsss.c_str());
        }

