fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
}

// 设备升级更新检测
void updateDevice(String upUrl,String updateversion){

    String ver = (String)version;
    String newver = (String)updateversion;
    Serial.println(ver); 
    Serial.println(newver); 

    if (ver == newver)
    {
        Serial.println("version equal "); 

        //FOTA开始的通知 mqtt 小程序提示
        send_fotamsg("fota_checked","已是最新版本","hiden",0,"--");
        return ;
    } 
    else if ( upUrl == ""){

       //FOTA开始的通知 mqtt 小程序提示
        send_fotamsg("fota_error","FOTA升级地址错误","hiden",0,"--");

        Serial.println("url error"); 
        return ;
    }


    //FOTA开始的通知 mqtt 小程序提示
    String toast = "";


    Serial.println("start update");    
    WiFiClient UpdateClient = client;

    //如果是旧版esp32 SDK，需要删除下面四行，旧版不支持，不然会报错
    httpUpdate.onStart(update_started);//当升级开始时
    httpUpdate.onEnd(update_finished);//当升级结束时
    httpUpdate.onProgress(update_progress);//当升级中
    httpUpdate.onError(update_error);//当升级失败时

    t_httpUpdate_return ret = httpUpdate.update(UpdateClient, upUrl);
    switch(ret) {
        case HTTP_UPDATE_FAILED:      //当升级失败
            toast = "FOTA升级失败";
            Serial.println("[update] Update failed.");
            break;
        case HTTP_UPDATE_NO_UPDATES:  //当无升级
            toast = "无FOTA升级";
            Serial.println("[update] Update no Update.");
            break;
        case HTTP_UPDATE_OK:         //当升级成功
            toast = "FOTA升级成功";
            Serial.println("[update] Update ok.");
            break;
    }      
}

 
/********http请求处理函数*********/
esp_err_t _http_event_handler(esp_http_client_event_t *evt)
{
    if (evt->event_id == HTTP_EVENT_ON_DATA)
    {
        httpResponseString.concat((char *)evt->data);
    }
    return ESP_OK;
}

/********推送图片*********/
static esp_err_t take_send_photo() {
  

    Serial.println("take_send_photo...");
    camera_fb_t* fb = NULL;
    esp_err_t res = ESP_OK;
    fb = esp_camera_fb_get();
    esp_camera_fb_return(fb);//重复利用一个缓存？？？
    fb = esp_camera_fb_get();
    esp_camera_fb_return(fb);//重复利用一个缓存？？？
    fb = esp_camera_fb_get();
    esp_camera_fb_return(fb);//重复利用一个缓存？？？
    fb = esp_camera_fb_get();
    esp_camera_fb_return(fb);//重复利用一个缓存？？？

    delay(50);
    fb = esp_camera_fb_get();

    if (!fb) {
        Serial.println("Camera capture failed...");
        return ESP_FAIL;
    }


    httpResponseString = "";
    esp_http_client_handle_t http_client;
    esp_http_client_config_t config_client = { 0 };

    // String urls = (post_url + fileName).c_str();

    String nonce = utils.md5str(reporttime +'0'+ random(1000));

    int64_t signt= esp_timer_get_time(); //获取本地时间戳
    // printf("time cnt:%lld\r\n",signt); //打印时间戳

    String did = utils.md5str(reporttime +'0'+ random(1000));


    String str5 = "file/uploadImg_appkey=" + appkey+"_did="+ did+ "_fileName=" + fileName +"_nonce="+nonce+ "_signt="+signt+"_version="+ version +"_"+ secretkey;

    String str6 =  utils.urlEncode(str5);

    String sign =  utils.md5str(str6);

    String urls = photourl+ "?fileName="+fileName+ "&version="+version+ "&did="+did+ "&nonce="+nonce+ "&signt="+signt+ "&appkey="+ appkey + "&sign="+sign;
    Serial.print("post_url:"+photourl);



    const char * url = urls.c_str();

    Serial.println(url);
    config_client.url = url;
    config_client.event_handler = _http_event_handler;
    config_client.method = HTTP_METHOD_POST;
    http_client = esp_http_client_init(&config_client);
    esp_http_client_set_post_field(http_client, (const char*)fb->buf, fb->len);  //设置http发送的内容和长度
    esp_http_client_set_header(http_client, "Content-Type", "image/jpg");        //设置http头部字段
//   esp_http_client_set_header(http_client, "Authorization", uid.c_str());               //设置http头部字段
//   esp_http_client_set_header(http_client, "Authtopic", topic);                 //设置http头部字段
//   esp_http_client_set_header(http_client, "wechatmsg", wechatMsg);             //设置http头部字段
//   esp_http_client_set_header(http_client, "wecommsg", wecomMsg);               //设置http头部字段
//   esp_http_client_set_header(http_client, "picpath", urlPath);                 //设置http头部字段
    esp_err_t err = esp_http_client_perform(http_client);                        //发送http请求
    if (err == ESP_OK) {
        Serial.println(httpResponseString);  //打印获取的URL
        //json数据解析
        StaticJsonDocument<200> doc;
        DeserializationError error = deserializeJson(doc, httpResponseString);
        if (error) {
            Serial.print(F("deserializeJson() failed: "));
            Serial.println(error.c_str());
        }
        boolean status = doc["status"];
        if (status)
        {
            // mqtt_username
            // SRCCID..'.' ..fileName

            // String sedStr = SRCCID+'.'+fileName;
            String ss = SRCCID;
            ss = ss +'.'+ fileName;
            Serial.print(ss.c_str());

            StaticJsonDocument<1024> doc;
            deserializeJson(doc, REPORT_PHOTO_TEMPLATE);
           // setClock();
            doc["cid"] = SRCCID;
            doc["filename"] = fileName;

            doc["datatype"] = "dictionary";
            doc["version"] = version;
            doc["reporttime"] = reporttime;

                
            TimeStruct stc =  utils.setClock(SRCCID);

            int64_t signt = stc.timeStamp ;

            doc["signt"] = (signt *1000)  ;
            String cidstr = SRCCID;
    
            String did = utils.md5str(reporttime +'0'+ random(1000));
            doc["did"] =  did;

            lastphotofileName = fileName;
        
            char  buffer[1024];
            size_t n = serializeJson(doc, buffer);
            Serial.println(buffer);

            // const char *mqtt_pub_topic = mqtt_pub_topicsss.c_str();

            if (mqttclient.publish( mqtt_pub_topicsss.c_str(), buffer,n)) {
                Serial.printf("auto topic photo [%s] ok\n",  mqtt_pub_topicsss.c_str());
            
            } else {
                Serial.printf("auto topic photo [%s] fail\n",  mqtt_pub_topicsss.c_str());
            }

