fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
    }
  }

    Serial.println("Taking picture END");
    esp_camera_fb_return(fb);
    esp_http_client_cleanup(http_client);

    return res;
}


// 获取通道ID和设置流媒体
void getChanneAndSetStreamSender(void) {

    streamSender.begin(WiFi.localIP(), localUdpPort);
    streamSender.setServer(udp_host.c_str(), udp_port);

}

// led alarm初始化
void cmd_GPIO_Init(){
    //设置io口为输出模式

    pinMode(alarm,OUTPUT);
    digitalWrite(alarm, LOW);

    pinMode(rc1,OUTPUT);
    digitalWrite(rc1, LOW);

    pinMode(rc2,OUTPUT);
    digitalWrite(rc2, LOW);

    pinMode(rc3,OUTPUT);
    digitalWrite(rc3, LOW);

    pinMode(rc4,OUTPUT);
    digitalWrite(rc4, LOW);
}

// 10s自动上报数据
void autoDataStatus(){
    unsigned char rc1_status = digitalRead(rc1) ;
    unsigned char rc2_status = digitalRead(rc2) ;
    unsigned char rc3_status = digitalRead(rc3) ;
    unsigned char rc4_status = digitalRead(rc4) ;

    unsigned char alarm_status = digitalRead(alarm) ;


    StaticJsonDocument<1024> doc;
    deserializeJson(doc, REPORT_DATA_TEMPLATE);

    TimeStruct stc =  utils.setClock(SRCCID);
    reporttime = stc.reporttime;
    fileName = stc.fileName;

    if (old_temp!=0 && old_humi !=0)
    {
          doc["temperature"] = old_temp;
          doc["humidity"] = old_humi;
    }
    
    // doc["temperature"] = 1.0*((int)(dht11.Temp*10))/10 + 1.0*dht11.Temp_small/10;//(String)Temp +"."+ (String)Temp_small ;
    // doc["humidity"] = 1.0*((int)(dht11.Humi*10))/10 + 1.0*dht11.Humi_small/10;//(String)Humi +"."+ (String)Humi_small ;
    doc["reporttime"] = reporttime;
    doc["alarm"] = alarm_status ? "open" : "close";
    doc["camera"] = cameraFlag ? "open" : "close";
    doc["ac"] = ac;
    doc["ac_temp"] = ac_temp;
    doc["ac_fan"] = ac_fan;
    
    doc["rc1"] = rc1_status ? "open" : "close";
    doc["rc2"] = rc2_status ? "open" : "close";
    doc["rc3"] = rc3_status ? "open" : "close";
    doc["rc4"] = rc4_status ? "open" : "close";
    

    doc["version"] = version;
    doc["demand"] = demand_count;

    

    doc["cid"] = SRCCID;
    doc["photoname"] = lastphotofileName;

    doc["airquality"] = old_airc;

    String cidstr = SRCCID;
    
    String did = utils.md5str(reporttime +'0'+ random(1000));
    doc["did"] =   did;


    char  buffer[1024];
    size_t n = serializeJson(doc, buffer);
  
    Serial.println(buffer);

    const char *mqtt_pub_topic = mqtt_pub_topicsss.c_str();
    if (mqttclient.publish( mqtt_pub_topicsss.c_str(),buffer,n)) {
        Serial.printf("auto topic [%s] ok\n",  mqtt_pub_topicsss.c_str());
        restartCount = 0;

    } else {
        Serial.printf("auto topic [%s] fail\n",  mqtt_pub_topicsss.c_str());
        restartCount++;

        //三次错误，就直接重启设备
        if (restartCount >=3)
        {
            alarmLevel = 3;
            restartCount = 0;
            Serial.printf("restarxxx3");
            // esp_restartFlag = true;//继续联网别重启
        }
    }

}

// 中断服务函数
void tim1Interrupt()
{
    if (videoUploadFlag)
    {
        tim1_IRQ_count++;
    }else{
        
        tim1_IRQ_count = 0;
        tim1_Photo_count++;
    }
    timerAlarmEnabled(tim1);
    autoUploadFlag = true;
}

// 定时器初始化
void timerInit(){

  tim1 = timerBegin(0, 80, true);
  timerAttachInterrupt(tim1, tim1Interrupt, true);
  timerAlarmWrite(tim1, 10000000ul, true);  //10s 10000000ul
  timerAlarmEnable(tim1);
  
}

// 0级别--告警关闭
void alarm_close(){
    digitalWrite(alarm,LOW);
}

// 1级别--告警
void alarm_low(){

    digitalWrite(alarm,HIGH);
    delay(10);
    digitalWrite(alarm,LOW);
    delay(200);

}
// 2级别--告警
void alarm_medium(){

    digitalWrite(alarm,HIGH);
    delay(100);
    digitalWrite(alarm,LOW);
    delay(100);

}

// 3级别--告警
void alarm_height(){
    digitalWrite(alarm,HIGH);
}

// 告警执行
void alarmAction(){

    switch (alarmLevel)
    {
        case 3:
            alarm_height();
            break;
        case 2://wifi断开
            alarm_medium();
            break;
        case 1://4路继电器打开
            alarm_low();
            break;
        case 0://4路继电器打开
            alarm_close();
            break;
        default:
            break;
    }

}

//远控停止控制上传video
void videoUploadStop(){
    videoUploadFlag = false;
    desetup_camera();
    streamSender.stop();
}

//远控下发控制上传video
void videoUploadBegin(){
    videoUploadFlag = true;
    videoUploadInitFlag= true;

    // setup_camera();
    // getChanneAndSetStreamSender();


}


// 自动化任务执行  10*1024内存 20条指令
void combinemonitorFunc(JsonArray cmdcombine){

    String demand_and= "demand_and";
    String demand_or= "demand_or";

    String compare_valuetype_String = "String";
    String compare_valuetype_Number = "Number";

    // 外设的值
    String compare_key_rc1 = "rc1";
    String compare_key_rc2 = "rc2";
    String compare_key_rc3 = "rc3";
    String compare_key_rc4 = "rc4";

    // 字段传感器的采集的值
    String compare_key_temperature = "temperature";
    String compare_key_humidity = "humidity";
    String compare_key_airquality = "airquality";

    // 运算符
    String compare_type_dy   = ">";
    String compare_type_dydy = ">=";
    String compare_type_hdy  = "=";
    String compare_type_xydy = "<=";
    String compare_type_xy   = "<";
    String compare_type_bdy  = "!=";

    // JsonArray array = doc.as<JsonArray>();
    for(auto dict : cmdcombine) {
        
        String autotype = dict["autotype"];
        
        JsonArray demandArr =  dict["demand"];
        JsonArray paramsArr =  dict["params"];
        
        // 数据运算比较
        if (autotype == demand_and)//与计算
        {
            // 是否执行的flag
            int8_t combineFlag = 0;

            for(JsonObject dict1 : demandArr) {
                String compare_key = dict1["compare_key"];
                String compare_type = dict1["compare_type"];
                String compare_valuetype = dict1["compare_valuetype"];
                auto compare_value = dict1["compare_value"];
            
                String compare_value_string = "";
                int    compare_value_number = 0;


                // 温度 
                if (compare_key == compare_key_temperature)
                {
                    compare_value_number = old_temp;

                } else if (compare_key == compare_key_humidity)
                {
                    compare_value_number = old_humi;

                } else if (compare_key == compare_key_airquality)
                {
                    compare_value_number = old_airc;

                } else if (compare_key == compare_key_rc1)
                {

                    compare_value_string = (old_rc1 == "I" ? "open":"close");

                } else if (compare_key == compare_key_rc2)
                {
                    compare_value_string = (old_rc2 == "I" ? "open":"close");

