fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
                } else if (compare_key == compare_key_rc3)
                {
                    compare_value_string = (old_rc3 == "I" ? "open":"close");

                } else if (compare_key == compare_key_rc4)
                {
                    compare_value_string = (old_rc4 == "I" ? "open":"close");

                }else
                {

                   Serial.printf("compare_key err:%s" , compare_key);

                }


                // 计算数据比较
                if (compare_type == compare_type_dy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_number > compare_value)
                        {
                            combineFlag++;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_string > compare_value)
                        {
                            combineFlag++;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }


                }else if (compare_type ==  compare_type_dydy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if ( compare_value_string >= compare_value)
                        {
  
                            combineFlag++;
                        }else{

                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number >= compare_value)
                        {
                            combineFlag++;
                        }else{


                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type ==  compare_type_hdy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string == compare_value)
                        {
                            combineFlag++;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if ( compare_value_number == compare_value)
                        {
                            combineFlag++;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type ==  compare_type_xydy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string <= compare_value)
                        {
                            combineFlag++;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number <= compare_value)
                        {
                            combineFlag++;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type ==  compare_type_xy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string < compare_value)
                        {
                            combineFlag++;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number < compare_value)
                        {
                            combineFlag++;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type ==  compare_type_bdy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string != compare_value)
                        {
                            combineFlag++;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number != compare_value)
                        {
                            combineFlag++;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else{


                   Serial.printf("compare_type55 err:%s" , compare_type);
            Serial.println(" ");

                }

            }

            // 最后是否执行的判断，是根据与全部满足执行
            if (combineFlag == demandArr.size())
            {
                // 触发执行
                combinecontrollFunc(paramsArr);               
            }else{
                 
            }





        }else if (autotype == demand_or)//或计算
        {
            // 是否执行的flag
            boolean combineFlag = false;

            for(JsonObject dict1 : demandArr) {
                String compare_key = dict1["compare_key"];
                String compare_type = dict1["compare_type"];
                String compare_valuetype = dict1["compare_valuetype"];
                auto compare_value = dict1["compare_value"];
            

                String compare_value_string = "";
                int    compare_value_number = 0;


                // 温度 
                if (compare_key == compare_key_temperature)
                {
                    compare_value_number = old_temp;

                } else if (compare_key == compare_key_humidity)
                {
                    compare_value_number = old_humi;

                } else if (compare_key == compare_key_airquality)
                {
                    compare_value_number = old_airc;

                } else if (compare_key == compare_key_rc1)
                {

                    compare_value_string = (old_rc1 == "I" ? "open":"close");

                } else if (compare_key == compare_key_rc2)
                {
                    compare_value_string = (old_rc2 == "I" ? "open":"close");

