fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
                } else if (compare_key == compare_key_rc3)
                {
                    compare_value_string = (old_rc3 == "I" ? "open":"close");

                } else if (compare_key == compare_key_rc4)
                {
                    compare_value_string = (old_rc4 == "I" ? "open":"close");

                }else
                {
                    Serial.println("ERROR 2");


                }


        // Serial.println(compare_type);

                // 计算数据比较
                if (compare_type == compare_type_dy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string > compare_value)
                        {
                            combineFlag = true;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number > compare_value)
                        {
                            combineFlag = true;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }


                }else if (compare_type == compare_type_dydy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if ( compare_value_string >= compare_value)
                        {
                            combineFlag = true;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number >= compare_value)
                        {
                            combineFlag = true;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }
                else if (compare_type == compare_type_hdy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string == compare_value)
                        {
                            combineFlag = true;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number == compare_value)
                        {
                            combineFlag = true;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type == compare_type_xydy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string <= compare_value)
                        {
                            combineFlag = true;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if ( compare_value_number <= compare_value)
                        {
                            combineFlag = true;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type == compare_type_xy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string < compare_value)
                        {
                            combineFlag = true;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number < compare_value)
                        {
                            combineFlag = true;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else if (compare_type == compare_type_bdy)
                {
                    if (compare_valuetype == compare_valuetype_String )
                    {
                        if (compare_value_string != compare_value)
                        {
                            combineFlag = true;
                        }

                    }else if(compare_valuetype == compare_valuetype_Number )
                    {
                        if (compare_value_number != compare_value)
                        {
                            combineFlag = true;
                        }
                    }else{
                        Serial.println("ERROR 3");
                    }

                }else{

                    Serial.println("ERROR 2");

                }


                // 最后是否执行的一个flag
                if (combineFlag)
                {
                    // 触发执行
                    combinecontrollFunc(paramsArr);
                    // 跳出当前这一个执行，进行下一个判断
                    break;
                }
            }

        }else{
            Serial.printf("autotype err:%s" , autotype);
            Serial.println("-");

        }

    }
} 

//一键执行  2*1024内存 20条指令
void combinecontrollFunc(JsonArray cmdcombine){

    String exe_controll= "exe_controll";
    String exe_delay= "exe_delay";

    Serial.println("combinecontroll begin");
    Serial.println(cmdcombine.size());
    Serial.println("combinecontroll end");

    // JsonArray array = doc.as<JsonArray>();
    for(JsonObject dict : cmdcombine) {
        String cmdtype =  dict["cmdtype"];
        Serial.println("cmdtype:"+cmdtype);

        if (cmdtype == exe_controll)
        {
            auto  cmddata = dict["cmddata"];
            String sensorname = cmddata["sensorname"];
            String sensorcmd= cmddata["sensorcmd"];
            Serial.println(sensorname);
            Serial.println(sensorcmd);

            if (sensorname == "rc1"){
                if(sensorcmd == "open")
                {
                    digitalWrite(rc1,HIGH);
                }else if(sensorcmd == "close")
                {
                    digitalWrite(rc1,LOW);
                }else{}

