fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
            }else if (sensorname == "rc2"){
                if(sensorcmd == "open")
                {
                        digitalWrite(rc2,HIGH);

                }else if(sensorcmd == "close")
                {
                        digitalWrite(rc2,LOW);

                }else{
                }

            }else if (sensorname == "rc3"){
                if(sensorcmd == "open")
                {
                    digitalWrite(rc3,HIGH);

                }else if(sensorcmd == "close")
                {
                    digitalWrite(rc3,LOW);

                }else{
                }

            }else if (sensorname == "rc4"){
                if(sensorcmd == "open")
                {
                    digitalWrite(rc4,HIGH);

                }else if(sensorcmd == "close")
                {
                    digitalWrite(rc4,LOW);

                }else{
                }

            }else if (sensorname == "alarm"){
                if(sensorcmd == "open")
                {
                    digitalWrite(alarm,HIGH);

                }else if(sensorcmd == "close")
                {
                    digitalWrite(alarm,LOW);

                }else{
                }

            }else if (sensorname == "exe_alarm1"){
                if(sensorcmd == "open")
                {
                    digitalWrite(alarm,HIGH);
                    delay(100);
                    digitalWrite(alarm,LOW);
                }else if(sensorcmd == "close")
                {
                    digitalWrite(alarm,LOW);
                }else{
                }

            }else if (sensorname == "exe_alarm2"){
                if(sensorcmd == "open")
                {
                    digitalWrite(alarm,HIGH);
                    delay(100);
                    digitalWrite(alarm,LOW);
                    delay(100);
                    digitalWrite(alarm,HIGH);
                    delay(100);
                    digitalWrite(alarm,LOW);

                }else if(sensorcmd == "close")
                {
                    digitalWrite(alarm,LOW);

                }else{
                }

            }else{
                Serial.println("unknown sensorname");

            }


        }else if (cmdtype == exe_delay)
        {
            auto  cmddata = dict["cmddata"];
            int timevalue = cmddata["timevalue"];
            Serial.printf("timevalue:%d" ,timevalue);
            delay(timevalue);

        }
        
    }

} 

// 平台下发的远控指令-回调
void callback(char* topic, byte* payload, unsigned int length)
{
    Serial.println(topic);    

    //json数据解析
    StaticJsonDocument<1024*2> doc;
    DeserializationError error = deserializeJson(doc, payload, length);
    if (error) {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.c_str());
    }
    
    String did= doc["did"];

    // 远控类型
    String cmdType = doc["cmdtype"];



    String cmd_combinecontroll= "cmd_combinecontroll";
    String cmd_combinemonitor= "cmd_combinemonitor";
    String cmd_controll= "cmd_controll";
    String cmd_status= "cmd_status";
    String cmd_statusack= "cmd_statusack";

    String cidstr = SRCCID ;
        
    String signt = doc["signt"]; 
    

    if (cmdType == cmd_controll)
    {
        // 远控命令
        Serial.println("cmd_controll");
        auto  cmddata = doc["cmddata"];
        String sensorname = cmddata["sensorname"];
        String sensorcmd= cmddata["sensorcmd"];

        if (sensorname == "takephoto")
        {
            Serial.println("takephoto");
            if (sensorcmd == "open")
            {
                Serial.println("takephoto");
                autoTakePhotoFlag = true;
                
            }else{
                Serial.println(sensorcmd);
            }
        }else if (sensorname == "camera")
        {
            Serial.println("camera");
            if(sensorcmd == "open")
            {
                Serial.println("open");
                cameraFlag = true;
                autoUploadFlag = true;
                videoUploadBegin();

            }else if(sensorcmd == "close")
            {
                Serial.println("close");
                cameraFlag = false;
                autoUploadFlag = true;
                videoUploadStop();

            }else{
                Serial.println(sensorcmd);
            }
        }else if (sensorname == "rc1"){
            Serial.println(sensorname);
            if(sensorcmd == "open")
            {
                Serial.println("open");
                digitalWrite(rc1,HIGH);
                autoUploadFlag = true;

            }else if(sensorcmd == "close")
            {
                Serial.println("close");
                digitalWrite(rc1,LOW);
                autoUploadFlag = true;

            }else{
                Serial.println(sensorcmd);
            }

        }else if (sensorname == "rc2"){
            Serial.println(sensorname);
            if(sensorcmd == "open")
            {
                Serial.println("open");
                digitalWrite(rc2,HIGH);
                autoUploadFlag = true;

            }else if(sensorcmd == "close")
            {
                Serial.println("close");
                digitalWrite(rc2,LOW);
                autoUploadFlag = true;

            }else{
                Serial.println(sensorcmd);
            }

        }else if (sensorname == "rc3"){
            Serial.println(sensorname);
            if(sensorcmd == "open")
            {
                Serial.println("open");
                digitalWrite(rc3,HIGH);
                autoUploadFlag = true;

            }else if(sensorcmd == "close")
            {
                Serial.println("close");
                digitalWrite(rc3,LOW);
                autoUploadFlag = true;

            }else{
                Serial.println(sensorcmd);
            }

        }else if (sensorname == "rc4"){
            Serial.println(sensorname);
          if(sensorcmd == "open")
            {
                Serial.println("open");
                digitalWrite(rc4,HIGH);
                autoUploadFlag = true;

            }else if(sensorcmd == "close")
            {
                Serial.println("close");
                digitalWrite(rc4,LOW);
                autoUploadFlag = true;

            }else{
                Serial.println(sensorcmd);
            }

        }else if (sensorname == "alarm"){
            Serial.println(sensorname);
            if(sensorcmd == "open")
            {
                Serial.println("open");
                alarmLevel = 3;
                // digitalWrite(alarm,HIGH);
                autoUploadFlag = true;

            }else if(sensorcmd == "close")
            {
                Serial.println("close");
                alarmLevel = 0;
                // digitalWrite(alarm,LOW);
                autoUploadFlag = true;

            }else{
                Serial.println(sensorcmd);
            }

        }else if (sensorname == "ac"){//控制空调
            Serial.println(sensorname);
            if(sensorcmd == "open")
            {
                Serial.println("open");

                uint8_t ac_mode = 1;//制热制冷-1制冷 4制热
                
                String ac_action = "";//下发的命令
                String ac_action_cmd = "";//调高

                // 空调的扩展指令 Temp温度 Mode加热/制冷--默认制冷 Fan风力--默认5auto
                auto  extdata = cmddata["extdata"];

                if (extdata.containsKey("mode")) {
                    ac_mode = extdata["mode"];//制热制冷-1制冷 4制热
                } else {
                  Serial.println("mode does not exist");
                }

                if (extdata.containsKey("fan")) {
                    ac_fan = extdata["fan"];//风力 5auto默认  3low 2 med 1high
                }  else {
                  Serial.println("fan does not exist");
                }

                if (extdata.containsKey("temp")) {
                    ac_temp =  extdata["temp"];//温度
                }  else {
                  Serial.println("temp does not exist");
                }
                
                //扩展指令类型 action 用于判断指令具体作用是 调整还是打开 
                if (extdata.containsKey("action")) {
                    String ac_actioncc =  extdata["action"];
                    ac_action = (String)ac_actioncc;
                }  else {
                  Serial.println("action does not exist");
                }

                if (extdata.containsKey("action_cmd")) {
                    String ac_action_cmdcc =  extdata["action_cmd"];
                    ac_action_cmd = (String)ac_action_cmdcc;

