fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
                }  else {
                  Serial.println("action_cmd does not exist");
                }

                Serial.println("ac_mode:"+ ac_mode);
                Serial.println("ac_fan:"+ ac_fan);
                Serial.println("ac_temp:"+ ac_temp);
                Serial.println("ac_action:"+ ac_action);
                Serial.println("ac_action_cmd:"+ ac_action_cmd);
                    

                //打开和修改都公用的指令

                // 参数方式
                //打开空调-默认
                haier_ac.on();
                //设置模式  (1) V9014557 Remote in "A" setting. (Default)
                haier_ac.setModel(V9014557_A);
                // setPower
                haier_ac.setPower(1);
                //设置按钮 5是电源
                haier_ac.setButton(5);
                //制热制冷-1制冷 4制热
                haier_ac.setMode(ac_mode);
                //设置温度
                haier_ac.setTemp(ac_temp);
                // 设置风扇 风力 5auto默认  3low 2 med 1high
                haier_ac.setFan(ac_fan);

                //设置强劲模式(涡轮增压) 若传入的是on则Quiet = false;
                haier_ac.setTurbo(false);
                //设置静音 若传入的是on则 Turbo = false;
                haier_ac.setQuiet(false);

                //垂直摆动模式 Set the Vertical Swing mode of the A/C.
                haier_ac.setSwingV(2);//Middle 2
                // 水平摆动模式 Set the Horizontal Swing mode of the A/C.
                haier_ac.setSwingH(0);//Middle 0
                // Set the Sleep setting of the A/C.
                haier_ac.setSleep(false);
                // Set the Health (filter) setting of the A/C.
                haier_ac.setHealth(true);

                //设置定时开启/关闭空调 Set the Timer operating mode.  0关闭
                haier_ac.setTimerMode(0);
                //设置开启时间 Set the number of minutes of the On Timer setting.
                /// @param[in] mins Nr. of Minutes for the Timer. `0` means disable the timer.
                haier_ac.setOnTimer(0);
                //设置关闭时间 Set the number of minutes of the Off Timer setting.
                // @param[in] mins Nr. of Minutes for the Timer. `0` means disable the timer.
                haier_ac.setOffTimer(0);

                //设置锁定 Set the Lock setting of the A/C.
                haier_ac.setLock(false); 


                //进行调整空调文档数据  根据扩展指令中的action字段，判断是：后续调整、第一次打开
                if (ac_action == "change")
                {
                    Serial.println("change okxxxxxxxxxxxxx");

                    // 如果有temp fan直接使用此值，如果没有temp则直接进行加/减1
                    if (extdata.containsKey("temp")) {
                        Serial.println("temp is exist 不需要操作 ");
                    }  else if (extdata.containsKey("fan")) {
                        Serial.println("fan is exist 不需要操作 ");
                    }  else{
                        //本地记时间，进行加减操作
                        Serial.println("temp does not exist");
                        if (ac_action_cmd == "temp_height")
                        {
                        Serial.println("height okxxxxxxxxxxxxx");

                          haier_ac.setButton(0); //0 是新增  1是减少
                            // ac_temp =  haier_ac.getTemp();  
                            //设置温度
                            ac_temp = ac_temp + 1;
                            haier_ac.setTemp(ac_temp);                          
                        }else if (ac_action_cmd == "temp_low") {

                          Serial.println("low okxxxxxxxxxxxxx");
                          haier_ac.setButton(1); //0 是新增  1是减少
                            // ac_temp =  haier_ac.getTemp();  
                            //设置温度
                            ac_temp = ac_temp - 1;
                            haier_ac.setTemp(ac_temp); 
                        }else if (ac_action_cmd == "fan_height") {  //风力三个档位 3最小 2居中 1最大

                          Serial.println("low okxxxxxxxxxxxxx");
                          if (ac_fan == 5 )//自动模式
                          {
                            ac_fan = 3;
                          }else if (ac_fan == 3)
                          {
                            ac_fan = 2;
                          }else if (ac_fan == 2)
                          {
                            ac_fan = 1;
                          }else  
                          {
                            ac_fan = 1;//最大
                          }
                          
                          haier_ac.setFan(ac_fan); //3最小 2居中 1最大

                        }else if (ac_action_cmd == "fan_low") {

                          Serial.println("low okxxxxxxxxxxxxx");
                           if (ac_fan == 1 )
                          {
                            ac_fan = 2;
                          }else if (ac_fan == 2)
                          {
                            ac_fan = 3;
                          }else if (ac_fan == 3)
                          {
                            ac_fan = 5;
                          }else  
                          {
                            ac_fan = 5;//自动模式
                          }
                          
                          haier_ac.setFan(ac_fan); //3最小 2居中 1最大

                        }
                        
                    }
                    Serial.println("send okxxxxxxxxxxxxx");

                    //最后 发送红外
                    haier_ac.send();

                    }else if (ac_action == "open"){
                      //默认的打开空调
                        Serial.println("ac_action open okxxxxxxxxxxxxx");

                        // 发射指令
                        Serial.println("a power_on capture from IRrecvDumpV2");
                        //指令方式
                        // irsend.sendRaw(power_on, 229, 38);  // Send a raw data capture at 38kHz.

                        //设置温度
                        haier_ac.setTemp(ac_temp);
                        haier_ac.setFan(ac_fan);
                       
                        //最后 发送红外
                        haier_ac.send();

                    }else{
                        Serial.println("ac_action err!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!");
                    }

                    // 修改空调flag状态
                    ac = "open";
                    autoUploadFlag = true;

                }else if(sensorcmd == "close")
                {
                    Serial.println("close");
                    Serial.println("a power_on capture from IRrecvDumpV2");
                    // irsend.sendRaw(power_off, 229, 38);  // Send a raw data capture at 38kHz.
                    haier_ac.off();
                    haier_ac.send();
                    ac = "close";
                    autoUploadFlag = true;

                }else{
                    Serial.println(sensorcmd);
                }

        }else if (sensorname == "restart"){
            Serial.println(sensorname);

            if(sensorcmd == "open")
            {
                Serial.println("open");
                autoUploadFlag = true;
                esp_restartFlag = true;

            }else{
                Serial.println(sensorcmd);
            }


        }else if (sensorname == "status"){
            Serial.println(sensorname);

            if(sensorcmd == "open")
            {
                Serial.println("open");
                //  -- 基础数据查询
                autoUploadFlag = true;

            }else{
                Serial.println(sensorcmd);
            }


        }else if (sensorname == "fota"){
            Serial.println(sensorname);

            if(sensorcmd == "open") 
            {
                updateversion = "";
                updateurl = "";


                Serial.println("open");
                //  -- 远程更新FOTA
                auto  extdata = cmddata["extdata"];
                String updateurlCC= extdata["updateurl"];
                updateurl = updateurlCC;
                String updateversions =  extdata["updateversion"];
                Serial.println(updateurl +":"+ updateversions);
                updateversion = updateversions;

                fotaFlag = true;
                fota_status = 1;

            }else{
                Serial.println(sensorcmd);
            }

        }else if (sensorname == "combinemonitor"){
            Serial.println(sensorname);

            if(sensorcmd == "open")
            {
                Serial.println("open");
                getCombinemonitorFlag = true;

            }else{
                Serial.println(sensorcmd);
            }


        }else{
             Serial.println(sensorname);
        }
        
        
    }else if (cmdType == cmd_status){
         //  -- 基础数据查询
        Serial.println("cmd_status");
        autoUploadFlag = true;

    }else if (cmdType == cmd_combinecontroll){
         //  -- 一键下发
        Serial.println("cmd_combinecontroll");
        auto params = doc["cmdcombine"]["params"];//数组
        
        JsonArray cmdcombine = params.as<JsonArray>();

        autoUploadFlag = true;
        combinecontrollFunc(cmdcombine); //2*1024内存 20条指令

    }else if (cmdType == cmd_combinemonitor){
         //  -- 自动化执行
        Serial.println("cmd_combinemonitor");
        getCombinemonitorFlag = true;
        autoUploadFlag = true;


        // combineAutoArrFlag = false;
        // DeserializationError error = deserializeJson(docauto, orinalpayload, length);
        // if (error) {
        //     Serial.print(F("deserializeJson() failed: "));
        //     Serial.println(error.c_str());
        // }
        // JsonArray cmdcombine = docauto["cmdcombine"].as<JsonArray>();
        // combineAutoArr = cmdcombine;//数组
        // autoUploadFlag = true;
        // combineAutoArrFlag = true;


