fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
    }else if (cmdType == cmd_statusack){
        //远控的ACK返回
        Serial.println("cmd_statusack");
        String reporttime = doc["reporttime"];
        old_reporttime = reporttime;

    }else{
        //其他类型
        Serial.println("ERROR 00");
        Serial.println(cmdType.c_str());
        Serial.println("ERROR 01");

    }

    // 返回远控的ACK消息
    if (cmdType != cmd_statusack && cmdType != cmd_status)
    {
        StaticJsonDocument<1024> docack;
        deserializeJson(docack, REPORT_CONTROLLACK_TEMPLATE);
        TimeStruct stc =  utils.setClock(SRCCID);
        reporttime = stc.reporttime;
        fileName = stc.fileName;

        docack["did"] =  did;
        docack["datatype"] =  "dictionary";
        docack["cid"] = SRCCID;

        docack["reporttime"] = reporttime;
        docack["version"] = version;

        int64_t timer1_cnt=esp_timer_get_time(); //获取本地时间戳
        // printf("time cnt:%lld\r\n",timer1_cnt); //打印时间戳

        docack["signt"] = timer1_cnt;
        String cidstr = SRCCID;
       
        
        char  buffer[1024];
        size_t n = serializeJson(docack, buffer);

        // const char *mqtt_pub_topic = mqtt_pub_topicsss.c_str();
        if (mqttclient.publish( mqtt_pub_topicsss.c_str(), buffer,n)) {
            Serial.printf("auto topic ack [%s] ok\n",  mqtt_pub_topicsss.c_str());
            
        } else {
            Serial.printf("auto topic ack [%s] fail\n",  mqtt_pub_topicsss.c_str());
        }

    }

       

}


//摄像头卸载退出
void desetup_camera(){
    // camera deinit 
    esp_err_t err = esp_camera_deinit();
    if (err != ESP_OK) {
        log_i("Camera deinit failed with error 0x%x", err);
        return;
    }else{
        log_i("esp_camera_deinit ok");
    }

}

//摄像头初始化
void setup_camera(){
    
    camera_config_t config;
    config.ledc_channel = LEDC_CHANNEL_0;
    config.ledc_timer = LEDC_TIMER_0;
    config.pin_d0 = Y2_GPIO_NUM;
    config.pin_d1 = Y3_GPIO_NUM;
    config.pin_d2 = Y4_GPIO_NUM;
    config.pin_d3 = Y5_GPIO_NUM;
    config.pin_d4 = Y6_GPIO_NUM;
    config.pin_d5 = Y7_GPIO_NUM;
    config.pin_d6 = Y8_GPIO_NUM;
    config.pin_d7 = Y9_GPIO_NUM;
    config.pin_xclk = XCLK_GPIO_NUM;
    config.pin_pclk = PCLK_GPIO_NUM;
    config.pin_vsync = VSYNC_GPIO_NUM;
    config.pin_href = HREF_GPIO_NUM;
    config.pin_sccb_sda = SIOD_GPIO_NUM;
    config.pin_sccb_scl = SIOC_GPIO_NUM;
    config.pin_pwdn = PWDN_GPIO_NUM;
    config.pin_reset = RESET_GPIO_NUM;
    config.xclk_freq_hz = 20000000;
    config.pixel_format = PIXFORMAT_JPEG;
    config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
    config.fb_location = CAMERA_FB_IN_PSRAM;
    config.jpeg_quality = 10;
    config.fb_count = 1;

    if (psramFound()) {
        config.frame_size = FRAMESIZE_SVGA;
        config.jpeg_quality = 3;
        config.fb_count = 2;
        config.grab_mode = CAMERA_GRAB_LATEST;
    } else {
        // 使用直接内存申请
        config.frame_size = FRAMESIZE_SVGA;//FRAMESIZE_QVGA 
        config.fb_location = CAMERA_FB_IN_DRAM;
    }


    // camera init 
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK) {
        log_i("Camera init failed with error 0x%x", err);
        return;
    }
    log_i("get sensor ");
    sensor_t *s = esp_camera_sensor_get();
    s->set_framesize(s, FRAMESIZE);

}

// void wdt_init(){
//     rtc_wdt_protect_off();     //看门狗写保护关闭 关闭后可以喂狗
//     //rtc_wdt_protect_on();    //看门狗写保护打开 打开后不能喂狗
//     //rtc_wdt_disable();       //禁用看门狗
//     rtc_wdt_enable();          //启用看门狗
//     rtc_wdt_set_time(RTC_WDT_STAGE0, 30000); // 设置看门狗超时 8000ms.则reset重启
// }


#include <esp32-hal.h>
#include <lwip/apps/sntp.h>
#include <stdarg.h>
#include <stdlib.h>
#include <time.h>

/**
 * @brief 设置时区和NTP服务器和并校对时间
 * @param [in] posix_tz 表示posix规范的时间戳。例如"UTC-8"表示东八区（北京时间）
 * @param [in] server_cnt NTP服务器的数量，超过三个的会被抛弃
 * @param [in] ... NTP服务器，C风格字符串指针类型，数量应与server_cnt对应
 * @attention 函数不会保证WiFi连接正常
 * @example set_time("UTC-8", 3, "time2.cloud.tencent.com", "ntp1.aliyun.com", "ntp.ntsc.ac.cn");
 * @example set_time("UTC+6", 2, "time2.cloud.tencent.com", "192.168.0.2");
 */
void set_time(const char *const posix_tz, const int server_cnt,const char* server1, const char* server2, const char* server3)
{
	sntp_setoperatingmode(SNTP_OPMODE_POLL);

    sntp_setservername(0, (char*)server1);
    sntp_setservername(1, (char*)server2);
    sntp_setservername(2, (char*)server3);

	sntp_init();
	setenv("TZ", posix_tz, 1);
	tzset();
	while (time(NULL) < 1580000000) // 阻塞，直到时间同步
		yield();
	sntp_stop();
}


// 屏幕初始化
void tft_setup(){
    tft.init();
    tft.setRotation(1);

}

// 屏幕显示
void ftf_display()
{
 
    // 用灰色填充屏幕，以便我们可以看到带有和不带有背景颜色定义的打印效果
    tft.fillScreen(TFT_BLACK);
 
    // 将“光标”设置在显示器的左上角(0,0)，并选择字体2
    // （在使用'tft.println'打印时，光标将自动移动到下一行
    // 或者如果有足够的空间，光标将停留在同一行上）
    tft.setCursor(0, 0, 2);
 
    // 将字体颜色设置为白色，背景为黑色，将文本大小乘数设置为1
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextSize(1);
    // 现在我们可以使用“print”类在屏幕上绘制文本
    tft.println(old_reporttime);

    // 设备状态
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.setTextFont(2);
    tft.print("status:  ");
    tft.println(deviceStatus);
    //  tft.println("");

    // 将字体颜色设置为黄色，没有背景，设置为字体7
    // tft.setTextColor(TFT_WHITE, TFT_BLACK);
    // tft.setTextFont(2);
    // tft.println("Temp: 36℃    Humi: 78%");
 
    // 将字体颜色设置为红色，背景为黑色，设置为字体4
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
   
    // 温度
    tft.setTextFont(4);
    tft.print("T:");
    tft.print(old_temp);
    tft.print("'C");

  // 湿度
    tft.print("  H:");
    tft.print(old_humi);
     tft.println("%");

//  空气质量

    tft.print("A:");
    tft.print(old_airc);
     tft.println("ppm");

    // tft.println("Alarm: close");
     tft.print("RC1:");
     tft.print(old_rc1);

     tft.print("  RC2:");
     tft.println(old_rc2);

     tft.print("RC3:");
     tft.print(old_rc3);
     tft.print("  RC4:");
     tft.print(old_rc4);
    // 测试一些打印格式化函数
    // float fnumber = 123.45;
    // 将字体颜色设置为蓝色，没有背景，设置为字体2
    // tft.setTextColor(TFT_WHITE, TFT_BLACK);
    // tft.setTextFont(2);
    // tft.print("Float = ");
    // tft.println(fnumber); // 打印浮点数
    // tft.print("Binary = ");
    // tft.println((int)fnumber, BIN); // 以二进制形式打印为整数值
    // tft.print("Hexadecimal = ");
    // tft.println((int)fnumber, HEX); // 以十六进制形式打印为整数值
 
   
