fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
}

// 子线程刷新屏幕
void  TaskDisplay(void *param){

    uint32_t blink_delay = 900;
    while (1)
    {
    
        delay(blink_delay);
        unsigned char rc1_status = digitalRead(rc1) ;
        unsigned char rc2_status = digitalRead(rc2) ;
        unsigned char rc3_status = digitalRead(rc3) ;
        unsigned char rc4_status = digitalRead(rc4) ;
        unsigned char alarm_status = digitalRead(alarm) ;
      
        uint c_temp = 1.0*((int)(dht11.Temp*10))/10 + 1.0*dht11.Temp_small/10;
        uint c_humi = 1.0*((int)(dht11.Humi*10))/10 + 1.0*dht11.Humi_small/10;

        uint  c_airc =   1.0*((int)(getVoltage(gasSensor)*10))/10;
   
   
        // 空气质量值变化，马上上报
        if ( c_airc != old_airc )
        {
            autoUploadFlag = true;
        }

        old_airc = c_airc;

        // 温湿度值变化，马上上报
        if (  old_temp != c_temp  || old_humi != c_humi)
        {
            autoUploadFlag = true;
        }
      
        old_temp = c_temp;
        old_humi = c_humi;


    // 设备有打开任何外设时，设备进行告警播报1S一次
    // if (rc1_status || rc2_status || rc3_status || rc4_status)
    // {
    //     alarmLevel = 1; //告警1

    // }else{
    //     alarmLevel = 0; //告警消除
    // }
    
    
        old_rc1 = rc1_status ? "I" : "O";
        old_rc2 = rc2_status ? "I" : "O";
        old_rc3 = rc3_status ? "I" : "O";
        old_rc4 = rc4_status ? "I" : "O";


        if (getCombinemonitorFlag)
        {
            getCombineAutoByCidHardware(SRCCID);

        }
   

        // 监控实时数据
       if (combineAutoArrFlag)
       {
        // Serial.println("--------------------------begin---------------------------");
            if (demand_count>0)
            {
                deviceStatus = "demand [ " + (String)demand_count + " ]";

            }else{
                deviceStatus = "demand [ " + (String)demand_count + " ]";
            }

            combinemonitorFunc(combineAutoArr);
        // Serial.println("--------------------------end---------------------------");

       }

   

        ftf_display();
        alarmAction();
    }
}




void setup() {

    // 屏幕初始化
    tft_setup();

    xTaskCreate(
        TaskDisplay       // 这个任务运行的函数
        ,  "Task Display" //  给人看的名字
        ,  8*1024        // 任务栈的大小，用于存储任务运行时的上下文信息。简单来说，就是最多存这么多信息
        ,  NULL // 任务参数。要么没有填NULL；要么必须为无类型指针
        ,  0  // 优先级
        ,  NULL // 任务的句柄，用于管理和控制任务，NULL相当于0，意味着此处不需要任务句柄
    );

    deviceStatus = "init Serial";


    // 红外发射初始化V2
    // 必须一开始就初始化，不然红外灯发热厉害--引脚1不用就注销掉
    // haier_ac.begin();


    Serial.begin(115200);
    Serial.setDebugOutput(true);
    while (!Serial) {
        /* code */
    }
    deviceStatus = "init GPIO";

    cmd_GPIO_Init();


    deviceStatus = "connect wifi";

    
    // utils.setup_wifi(ssid, passwd);
    int numNetworks = sizeof(wifiData) / sizeof(wifiData[0]);
    utils.setup_wifi(wifiData, numNetworks);

    configTime(8 * 3600, 0, NTP1, NTP2, NTP3);
    
    // set_time("UTC-8", 3, "time2.cloud.tencent.com", "ntp1.aliyun.com", "ntp.ntsc.ac.cn");

    String mac = utils.getmac();

    deviceStatus = "get device info";

    getDeviceByMac(mac);
    getCombineAutoByCidHardware(SRCCID);


    deviceStatus = "mqtt connecting";


    // connect mqtt server
    mqttclient.setServer(mqtt_mqttHostUrl.c_str(), mqtt_port);
    mqttclient.setCallback(callback);
    mqttclient.setKeepAlive(60);
    while (!mqttclient.connect(mqtt_mqttClientId.c_str(), mqtt_username.c_str(), mqtt_passwd.c_str())) {
        Serial.println("mqtt connect fail, reconnect");
        deviceStatus = "mqtt connect err";

        int numNetworks = sizeof(wifiData) / sizeof(wifiData[0]);
        utils.setup_wifi(wifiData, numNetworks);

    }

    Serial.println("mqtt connected!");
    deviceStatus = "mqtt connected!";

    // sub topic
    boolean ret = mqttclient.subscribe(mqtt_sub_topicsss.c_str());
    if (ret != true) {
        Serial.printf("mqtt subscribe topic [%s] fail\n", mqtt_sub_topicsss.c_str());
    }
    Serial.printf("mqtt subscribe topic [%s] ok\n", mqtt_sub_topicsss.c_str());


    // wdt_init();
    // Serial.printf("wdt_init\n");
    
    //定时器
    timerInit();

}




void reconnect() {
    deviceStatus = "reconnect mqtt";

    while (!mqttclient.connected()) {

        alarmLevel = 3; //告警
        // alarmAction();

        // 重新打开wifi链接、
        Serial.println("reset wifi ...");
    
        int numNetworks = sizeof(wifiData) / sizeof(wifiData[0]);
        utils.setup_wifi(wifiData, numNetworks);

    
        Serial.print("Attempting MQTT connection...");
        // Attempt to connect
        if (mqttclient.connect(mqtt_mqttClientId.c_str(), mqtt_username.c_str(), mqtt_passwd.c_str())) {
            Serial.println("connected");
            alarmLevel = 0; //告警消除
            // 连接成功时订阅主题
            deviceStatus = "connect mqtt ok";
            // const char *mqtt_sub_topic =  mqtt_sub_topicsss.c_str();
            mqttclient.subscribe(mqtt_sub_topicsss.c_str());
            autoUploadFlag = 1;
      
        } else {

          Serial.print("failed, rc=");
          Serial.print(mqttclient.state());
          Serial.println(" try again in 3 seconds");
          // Wait 5 seconds before retrying
          delay(3000);
        }
    }
}


/*MQ135空气质量检测传感器模块（有害物体 氨气 硫化物检测)
 程序之一
 */
//   float voltage;  voltage = getVoltage(gasSensor);
 float getVoltage(int pin){

  return (analogRead(pin) * 0.004882814); 
 }


void loop() {

    Serial.println("do loop");
    camera_fb_t *fb = NULL;//拍照缓存
    size_t len;//拍照的数据字节长度

    while (true)
    {

        if (!mqttclient.connected()) {
            //断网重来开始
            Serial.println("do loop 断网重连开始");
            reconnect();
        }
        // client loop
        mqttclient.loop();

        
        // 是否FOTA
        if (fotaFlag)
        {
            deviceStatus = "FOTA";
            fotaFlag = false;
            updateDevice(updateurl,updateversion);
        }

        // 是否上报设备状态 10s中断上报
        if (autoUploadFlag)
        {
            dht11 = utils.DHT11(); //读取温湿度
            // printf("Temp=%d.%d℃--Humi=%d.%d%%RH \r\n", Temp,Temp_small,Humi,Humi_small);
            autoUploadFlag = false;
            autoDataStatus();
        }

        if (autoTakePhotoFlag)//远程拍照
        { 
            autoTakePhotoFlag = false;
            TimeStruct stc =  utils.setClock(SRCCID);
            reporttime = stc.reporttime;
            fileName = stc.fileName;
            setup_camera();
            take_send_photo();
            desetup_camera();
            
