fairycloudpublic/FairyCloud_ESP32S3BD_PUBLIC/code/src/main.cpp
        }
        //过一分钟，自动拍照
        if (tim1_Photo_count > 60 )
        {
            tim1_Photo_count = 0;
            autoTakePhotoFlag = true;
        }
        
        
        // 是否上报视频流
        if (videoUploadFlag)
        {
            if (videoUploadInitFlag)//没有初始化的时候，进行初始化，仅一次
            {
                videoUploadInitFlag = false;
                setup_camera();
                getChanneAndSetStreamSender();
            }
            
            // log_i("send image");
            fb = esp_camera_fb_get();
            if (!fb) {
                Serial.println("Camera capture failed");
                break;
            }
            
            len = fb->len;//拍照字节长度赋值给len
            // fb->buf[len] = channel_index;//赋值给buf的最后一位，是通道ID

            size_t srccitlent = strlen(SRCCID.c_str());
            // Serial.println(srccitlent);

            for (size_t i = 0; i < srccitlent; i++)
            {
               fb->buf[len+i] =SRCCID[i];
            }
            
            streamSender.send(fb->buf, len + srccitlent); //发送数据，带上通道ID，总长度+1
            esp_camera_fb_return(fb);//重复利用一个缓存？？？
            delay(500);//受限带宽1MBSP，慢点发图片给服务端

        }

        //视频流超过5分钟，自动断开   10一次，6对应一分钟
        if (tim1_IRQ_count > 6  & videoUploadFlag )
        {
            cameraFlag = false;
            videoUploadFlag = false;
            // desetup_camera();//卸载摄像头
            Serial.println("tim1_IRQ_count 超过1分钟自动断开");
            tim1_IRQ_count  =0;
            videoUploadStop();
        }

        if (esp_restartFlag )
        {
            esp_restartFlag = false;
            mqttclient.disconnect();
            delay(200);
            esp_restart();
        }
 
    }

}
